# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [104]:
import numpy as np
import pandas as pd

In [105]:
from numpy.random import randn

In [10]:
# set seed to ensure random nums are the same
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['c1','c2','c3','c4'])

In [16]:
df

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [18]:
df['c3'] # each col is a pandas series

A   -0.376519
B   -0.031160
C    0.187125
D    0.961458
E   -1.046780
Name: c3, dtype: float64

In [25]:
df.c4 # dot notation like SQL syntax, but brack notation is best practice

A    0.230336
B    1.939932
C   -0.732845
D   -2.141212
E    1.292765
Name: c4, dtype: float64

In [26]:
# Pass a list of column names
df[['c3','c4']] # returns dataframe

         c3        c4
A -0.376519  0.230336
B -0.031160  1.939932
C  0.187125 -0.732845
D  0.961458 -2.141212
E -1.046780  1.292765

In [22]:
df[['c4','c4']]

         c4        c4
A  0.230336  0.230336
B  1.939932  1.939932
C -0.732845 -0.732845
D -2.141212 -2.141212
E  1.292765  1.292765

In [27]:
df[['c4','c3']]

         c4        c3
A  0.230336 -0.376519
B  1.939932 -0.031160
C -0.732845  0.187125
D -2.141212  0.961458
E  1.292765 -1.046780

In [29]:
# DataFrame Columns are just Series
type(df['c3'])

pandas.core.series.Series

Creating a new column:

In [30]:
df['new'] = df['c1'] + df['c4']

In [31]:
df

         c1        c2        c3        c4       new
A  0.386030  2.084019 -0.376519  0.230336  0.616367
B  0.681209  1.035125 -0.031160  1.939932  2.621142
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032
D -1.382920  1.482495  0.961458 -2.141212 -3.524132
E  0.992573  1.192241 -1.046780  1.292765  2.285338

In [33]:
# Removing Columns
df.drop('new', axis=1) # axis default is 0, which is the index, not col

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [35]:
df # new col still exists, unless inplace set to True

         c1        c2        c3        c4       new
A  0.386030  2.084019 -0.376519  0.230336  0.616367
B  0.681209  1.035125 -0.031160  1.939932  2.621142
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032
D -1.382920  1.482495  0.961458 -2.141212 -3.524132
E  0.992573  1.192241 -1.046780  1.292765  2.285338

In [36]:
df.drop('new', axis=1, inplace=True)

In [40]:
df # new column permanently dropped

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [43]:
# Can also drop rows this way:
df.drop('E', axis=0) # set inplace=True to drop permanently

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [44]:
df

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [46]:
df.shape # returns tuple (rows, cols)

(5, 4)

**Selecting Rows**

In [50]:
# Two ways to select rows
# by label
df.loc['D'] # rows are series

c1   -1.382920
c2    1.482495
c3    0.961458
c4   -2.141212
Name: D, dtype: float64

In [52]:
# by index
df.iloc[3]

c1   -1.382920
c2    1.482495
c3    0.961458
c4   -2.141212
Name: D, dtype: float64

**Selecting subset of rows and columns**

In [55]:
# subset of rows
df.iloc[2:4] # returns dataframe

         c1        c2        c3        c4
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [58]:
df.loc['B','c4'] # [row, col] by label

1.9399323109926203

In [59]:
df.loc[['B','E'],'c4'] # returns series

B    1.939932
E    1.292765
Name: c4, dtype: float64

In [62]:
df.loc[['B','E'],['c4','c3']] # returns a dataframe

         c4       c3
B  1.939932 -0.03116
E  1.292765 -1.04678

In [63]:
df.iloc[2:4,1] # returns series

C   -0.741790
D    1.482495
Name: c2, dtype: float64

In [64]:
df.iloc[2:4,1:4]  # returns a dataframe

         c2        c3        c4
C -0.741790  0.187125 -0.732845
D  1.482495  0.961458 -2.141212

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [65]:
df>0

      c1     c2     c3     c4
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [66]:
booldf = df>0

In [67]:
booldf

      c1     c2     c3     c4
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [68]:
df[booldf]

         c1        c2        c3        c4
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [69]:
df[df>0]

         c1        c2        c3        c4
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [73]:
df['c4']>0 # condition based on 1 col

A     True
B     True
C    False
D    False
E     True
Name: c4, dtype: bool

In [71]:
df[df['c4']>0] # returns all rows and cols where col c4 is True

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [74]:
df[df['c1']<0] # returns dataframe

         c1        c2        c3        c4
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [76]:
df[df['c1']<0]['c2'] # returns series

C   -0.741790
D    1.482495
Name: c2, dtype: float64

In [79]:
# select multiple cols
df[df['c1']<0][['c2','c4', 'c3']]  # returns dataframe

         c2        c4        c3
C -0.741790 -0.732845  0.187125
D  1.482495 -2.141212  0.961458

For two conditions you can use | and & with parenthesis:

In [81]:
df[(df['c1']>0) & (df['c4']>1)]

         c1        c2       c3        c4
B  0.681209  1.035125 -0.03116  1.939932
E  0.992573  1.192241 -1.04678  1.292765

In [82]:
df[(df['c1']>0) | (df['c4']>1)]

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [83]:
df

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [87]:
df.reset_index() # the oringal index becomes a col, new index is numerical default 0,1...n index
# set inplace=True to apply to original dataframe

  index        c1        c2        c3        c4
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [86]:
df

         c1        c2        c3        c4
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [90]:
newind = 'CA NY WY OR CO'.split() # quick way to create a list

In [91]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [92]:
df['States'] = newind # add as new column

In [93]:
df

         c1        c2        c3        c4 States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

In [94]:
df.set_index('States') # specify col name to be index
# set inplace=True to apply to original dataframe
# But you will lose original index, unless .reset_index() to change it to a column

              c1        c2        c3        c4
States
CA      0.386030  2.084019 -0.376519  0.230336
NY      0.681209  1.035125 -0.031160  1.939932
WY     -1.005187 -0.741790  0.187125 -0.732845
OR     -1.382920  1.482495  0.961458 -2.141212
CO      0.992573  1.192241 -1.046780  1.292765

In [95]:
df

         c1        c2        c3        c4 States
A  0.386030  2.084019 -0.376519  0.230336     CA
B  0.681209  1.035125 -0.031160  1.939932     NY
C -1.005187 -0.741790  0.187125 -0.732845     WY
D -1.382920  1.482495  0.961458 -2.141212     OR
E  0.992573  1.192241 -1.046780  1.292765     CO

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [106]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index) # pandas multi index function to create df from list of tuples

In [107]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [108]:
inside

[1, 2, 3, 1, 2, 3]

In [109]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [110]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B']) # 6x2 dataframe

In [111]:
df

             A         B
G1 1 -1.467514 -0.494095
   2 -0.162535  0.485809
   3  0.392489  0.221491
G2 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338

In [113]:
df.loc['G1'] # start with outer most index

          A         B
1 -1.467514 -0.494095
2 -0.162535  0.485809
3  0.392489  0.221491

In [114]:
df.loc['G1'].loc[3]

A    0.392489
B    0.221491
Name: 3, dtype: float64

In [123]:
df.index.names = ['Groups', 'Nums'] # label the indexes

In [124]:
df

                    A         B
Groups Nums
G1     1    -1.467514 -0.494095
       2    -0.162535  0.485809
       3     0.392489  0.221491
G2     1    -0.855196  1.541990
       2     0.666319 -0.538235
       3    -0.568581  1.407338

In [125]:
df.loc['G2'].loc[2]['B'] # select 3rd index for G2 outer index in col B

-0.5382346255173922

In [128]:
df.loc['G1'].loc[1]['A'] # select 1st index for G1 outer index in col A

-1.4675140203361003

In [129]:
# cross section of rows and cols for when you have multilevel index
df.xs('G1')

             A         B
Nums
1    -1.467514 -0.494095
2    -0.162535  0.485809
3     0.392489  0.221491

In [130]:
df.xs('G2')

             A         B
Nums
1    -0.855196  1.541990
2     0.666319 -0.538235
3    -0.568581  1.407338

In [134]:
# G1, inside index 1
df.xs(['G1', 1])

A   -1.467514
B   -0.494095
Name: (G1, 1), dtype: float64

In [137]:
# inside index 1 using level
df.xs(1, level='Nums')

               A         B
Groups
G1     -1.467514 -0.494095
G2     -0.855196  1.541990

In [138]:
df.xs(3, level='Nums')

               A         B
Groups
G1      0.392489  0.221491
G2     -0.568581  1.407338

In [139]:
df.xs('G2', level='Groups')

             A         B
Nums
1    -0.855196  1.541990
2     0.666319 -0.538235
3    -0.568581  1.407338